POST_NUMBER = 28500 #Номер поста, с которого начнет парсить. Находите последнйи пост, отнимаете условно тысячу или 2, вставляете.

LAST_POST_NUMBER = 286040 #Номер последнего поста, который вы нашли. Чтобы софт не работал бесконечно.

NEED_TO_SAVE = True #Записывать в файл ссылки на раффл или нет. #True - да, False - нет.

#Токен телеграм бота. Получить в @botfather. После того как создадите бота, напишите ему /start.
TOKEN = 'qwertyuiop:ASDFGHJKL12345'

#Ваш id телеграм. Получать в @myidbot командой -> "/getid"
SEND_TO = 1234567890

#Ссылка по которой меняется прокси
LINK_TO_CHANGE_PROXY = 'LINK_TO_CHANGE_PROXY'

#Мобильная прокся в формате LOG:PASS@IP:PORT
MOBILE_PROXY = 'LOG:PASS@Ip:PORT'